{
	"projects": [
		{
			"id": "personal-website",
			"title": "Personal Website & Blog",
			"description": "A personal website and blog built with Astro, React and Emotion-Styled-Components. Features a short overview of my personal projects, skills and work experience.",
			"technologies": ["Astro", "React", "Emotion"],
			"image": "/images/portfolio/blog-placeholder-2.jpg",
			"githubUrl": "https://github.com/daniel-tenzler/daniel-tenzler.github.io",
			"liveUrl": "https://daniel-tenzler.github.io",
			"featured": true,
			"date": "2025-05"
		},
		{
			"id": "task-set-generator",
			"title": "Task Set Generator for evaluating distributed, real-time scheduling algorithms",
			"description": "A comprehensive task set generator designed for evaluating distributed, real-time scheduling algorithms. This bachelor's thesis project enables researchers and developers to generate configurable task sets with precise control over parameters such as task periods, deadlines, execution times, and resource requirements. The tool supports various scheduling algorithm evaluation scenarios, helping validate the performance and feasibility of novel scheduling approaches in distributed computing environments. Built with Java and integrates Google-OR-Tools for optimization problems and Integer Linear Programming (ILP) for complex constraint solving.",
			"technologies": ["Java", "Google-OR-Tools", "ILP"],
			"image": "/images/portfolio/blog-placeholder-3.jpg",
			"githubUrl": "https://github.com/Daniel-Tenzler/TaskSetGenerator",
			"liveUrl": "",
			"featured": true,
			"date": "2024-06"
		},
		{
			"id": "js-sensor-backend",
			"title": "Simple backend for a Raspberry Pi mounting a DHT22 sensor",
			"description": "A Node.js/Express application for collecting and displaying sensor data collected by Adafruit DHT22. Uses Supabase for data storage and provides a simple frontend to display the data.",
			"technologies": ["Node.js", "Supabase"],
			"image": "/images/portfolio/blog-placeholder-5.jpg",
			"githubUrl": "https://github.com/Daniel-Tenzler/sensor-backend",
			"liveUrl": "",
			"featured": true,
			"date": "2024-06"
		}
	]
}
